esp8266/Arduino/libraries/ESP8266WiFi/src/WiFiClientSecureBearSSL.cpp
// AXTLS compatibility interfaces
bool WiFiClientSecure::setCACert(const uint8_t* pk, size_t size) {
  if (_ta && _deleteChainKeyTA) {
    delete _ta;
    _ta = nullptr;
  }
  _ta = new X509List(pk, size);
  _deleteChainKeyTA = true;
  return _ta ? true : false;
}

bool WiFiClientSecure::setCertificate(const uint8_t* pk, size_t size) {
  if (_chain && _deleteChainKeyTA) {
    delete _chain;
    _chain = nullptr;
  }
  _chain = new X509List(pk, size);
  _deleteChainKeyTA = true;
  return _chain ? true : false;
}

bool WiFiClientSecure::setPrivateKey(const uint8_t* pk, size_t size) {
  if (_sk && _deleteChainKeyTA) {
    delete _sk;
    _sk = nullptr;
  }
  _sk = new PrivateKey(pk, size);
  _deleteChainKeyTA = true;
  return _sk ? true : false;

}

uint8_t *WiFiClientSecure::_streamLoad(Stream& stream, size_t size) {
  uint8_t *dest = (uint8_t*)malloc(size);
  if (!dest) {
    return nullptr;
  }
  if (size != stream.readBytes(dest, size)) {
    free(dest);
    return nullptr;
  }
  return dest;
}

bool WiFiClientSecure::loadCACert(Stream& stream, size_t size) {
  uint8_t *dest = _streamLoad(stream, size);
  bool ret = false;
  if (dest) {
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored  "-Wdeprecated-declarations"
    ret = setCACert(dest, size);
#pragma GCC diagnostic pop
  }
  free(dest);
  return ret;
}

bool WiFiClientSecure::loadCertificate(Stream& stream, size_t size) {
  uint8_t *dest = _streamLoad(stream, size);
  bool ret = false;
  if (dest) {
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored  "-Wdeprecated-declarations"
    ret = setCertificate(dest, size);
#pragma GCC diagnostic pop
  }
  free(dest);
  return ret;
}

bool WiFiClientSecure::loadPrivateKey(Stream& stream, size_t size) {
  uint8_t *dest = _streamLoad(stream, size);
  bool ret = false;
  if (dest) {
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored  "-Wdeprecated-declarations"
    ret = setPrivateKey(dest, size);
#pragma GCC diagnostic pop
  }
  free(dest);
  return ret;
}

};
